{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.9.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "5"}, {"size": "5"}, {"size": "5"}]}}}, "outputs": {"v": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "pi": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "125"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/pi/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "125"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/pi/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "125"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/global_average_pooling3d/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "5"}, {"size": "5"}, {"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_32/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_32/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_31/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_31/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_30/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_30/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_29/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_29/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_28/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_28/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_27/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_27/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_26/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_25/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_25/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_24/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_23/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_22/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_21/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_20/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_19/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_18/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_17/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_16/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_15/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_14/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_13/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_12/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_11/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_10/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_9/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_8/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_7/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_6/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_5/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d_4/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_3/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_2/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/conv3d_1/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/conv3d/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "5"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["input_1", "StatefulPartitionedCall/model/conv3d/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation/Relu", "StatefulPartitionedCall/model/conv3d_1/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_1/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_1/Relu", "StatefulPartitionedCall/model/conv3d_2/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation/Relu"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_2/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_2/Relu", "StatefulPartitionedCall/model/conv3d_3/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_3/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_3/Relu", "StatefulPartitionedCall/model/conv3d_4/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/add_1/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_4/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_1/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_4/Relu", "StatefulPartitionedCall/model/conv3d_5/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_5/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_5/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_5/Relu", "StatefulPartitionedCall/model/conv3d_6/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model/add_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_4/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_2/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_6/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_2/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_6/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_2/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_6/Relu", "StatefulPartitionedCall/model/conv3d_7/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_7/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_7/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_7/Relu", "StatefulPartitionedCall/model/conv3d_8/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/add_3/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_6/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_3/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_8/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_3/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_8/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_3/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_8/Relu", "StatefulPartitionedCall/model/conv3d_9/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_9/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_9/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_9/Relu", "StatefulPartitionedCall/model/conv3d_10/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/add_4/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_8/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_4/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_10/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_4/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_10/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_4/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_10/Relu", "StatefulPartitionedCall/model/conv3d_11/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_11/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_11/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_11/Relu", "StatefulPartitionedCall/model/conv3d_12/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_5/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_10/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/add_5/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_12/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_5/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_12/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_5/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_12/Relu", "StatefulPartitionedCall/model/conv3d_13/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_13/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_13/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_13/Relu", "StatefulPartitionedCall/model/conv3d_14/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_6/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_12/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_6/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_14/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_6/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_14/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_6/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_14/Relu", "StatefulPartitionedCall/model/conv3d_15/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_15/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_15/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_15/Relu", "StatefulPartitionedCall/model/conv3d_16/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model/add_7/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_14/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_7/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_16/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_7/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_16/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_7/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_16/Relu", "StatefulPartitionedCall/model/conv3d_17/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_17/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_17/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_17/Relu", "StatefulPartitionedCall/model/conv3d_18/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model/add_8/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_16/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_8/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_18/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_8/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_18/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_8/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_18/Relu", "StatefulPartitionedCall/model/conv3d_19/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_19/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_19/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_19/Relu", "StatefulPartitionedCall/model/conv3d_20/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model/add_9/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_18/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_9/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_20/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_9/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_20/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_9/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_20/Relu", "StatefulPartitionedCall/model/conv3d_21/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_21/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_21/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_21/Relu", "StatefulPartitionedCall/model/conv3d_22/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/add_10/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_20/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/add_10/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_22/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_10/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_22/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_10/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_22/Relu", "StatefulPartitionedCall/model/conv3d_23/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_23/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_23/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_23/Relu", "StatefulPartitionedCall/model/conv3d_24/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/add_11/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_22/Relu"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/add_11/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_24/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_11/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_24/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_11/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_25/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_24/Relu", "StatefulPartitionedCall/model/conv3d_25/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_25/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model/batch_normalization_25/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/batch_normalization_25/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/activation_25/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/batch_normalization_25/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_25/Relu", "StatefulPartitionedCall/model/conv3d_26/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model/add_12/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model/activation_24/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/add_12/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model/batch_normalization_26/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model/add_12/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model/activation_26/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model/add_12/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/batch_normalization_27/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model/activation_26/Relu", "StatefulPartitionedCall/model/conv3d_27/Conv3D/merged_input"], 