{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.9.0", "signature": {"inputs": {"input_2": {"name": "input_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "4"}, {"size": "4"}, {"size": "4"}]}}}, "outputs": {"v": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}, "pi": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1/pi/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/pi/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/global_average_pooling3d_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "2"}, {"size": "4"}, {"size": "4"}, {"size": "4"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_33/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_65/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_65/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_64/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_64/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_63/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_63/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_62/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_62/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_61/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_61/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_60/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_60/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_59/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_59/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_58/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_58/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_57/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_57/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_56/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_56/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_55/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_55/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_54/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_54/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_53/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_53/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_52/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_52/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_51/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_51/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_50/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_50/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_49/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_49/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_48/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_48/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_47/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_47/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_46/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_46/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_45/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_45/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_44/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_44/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_43/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_43/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_42/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_42/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_41/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_41/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_40/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_40/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_39/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_39/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_38/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_38/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_37/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_37/FusedBatchNormV3/Offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_36/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_36/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_35/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_35/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_34/Conv3D/merged_input", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_34/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/conv3d_33/Conv3D/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "4"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_33/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["input_2", "StatefulPartitionedCall/model_1/conv3d_33/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_33/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_33/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_33/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_33/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_33/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_34/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_33/Relu", "StatefulPartitionedCall/model_1/conv3d_34/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_34/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_34/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_34/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_34/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_34/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_35/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_34/Relu", "StatefulPartitionedCall/model_1/conv3d_35/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/add_16/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_35/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_33/Relu"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/add_16/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_35/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_16/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_35/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_16/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_36/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_35/Relu", "StatefulPartitionedCall/model_1/conv3d_36/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_36/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_36/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_36/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_36/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_36/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_37/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_36/Relu", "StatefulPartitionedCall/model_1/conv3d_37/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_17/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_37/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_35/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1/add_17/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_37/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_17/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_37/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_17/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_38/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_37/Relu", "StatefulPartitionedCall/model_1/conv3d_38/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_38/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_38/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_38/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_38/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_38/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_39/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_38/Relu", "StatefulPartitionedCall/model_1/conv3d_39/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/add_18/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_39/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_37/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1/add_18/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_39/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_18/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/activation_39/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_18/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_40/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_39/Relu", "StatefulPartitionedCall/model_1/conv3d_40/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_40/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_40/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_40/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_40/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_40/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_41/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_40/Relu", "StatefulPartitionedCall/model_1/conv3d_41/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model_1/add_19/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_41/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_39/Relu"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_19/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_41/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_19/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_41/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_19/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_42/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_41/Relu", "StatefulPartitionedCall/model_1/conv3d_42/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_42/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_42/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_42/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_42/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_42/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_43/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_42/Relu", "StatefulPartitionedCall/model_1/conv3d_43/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/add_20/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_43/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_41/Relu"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_20/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_43/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_20/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/activation_43/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_20/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_44/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_43/Relu", "StatefulPartitionedCall/model_1/conv3d_44/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_44/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_44/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_44/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_44/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_44/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_45/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_44/Relu", "StatefulPartitionedCall/model_1/conv3d_45/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_21/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_45/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_43/Relu"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_21/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_45/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_21/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_45/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_21/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_46/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_45/Relu", "StatefulPartitionedCall/model_1/conv3d_46/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_46/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_46/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_46/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_46/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_46/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_47/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_46/Relu", "StatefulPartitionedCall/model_1/conv3d_47/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/add_22/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_47/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_45/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_22/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_47/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_22/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/activation_47/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_22/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_48/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_47/Relu", "StatefulPartitionedCall/model_1/conv3d_48/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_48/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_48/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_48/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_48/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_48/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_49/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_48/Relu", "StatefulPartitionedCall/model_1/conv3d_49/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_23/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_49/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_47/Relu"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/add_23/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_49/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_23/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/activation_49/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_23/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_50/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_49/Relu", "StatefulPartitionedCall/model_1/conv3d_50/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_50/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_50/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_50/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_50/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_50/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_51/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_50/Relu", "StatefulPartitionedCall/model_1/conv3d_51/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/model_1/add_24/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_51/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_49/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1/add_24/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_51/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_24/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/activation_51/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_24/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_52/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_51/Relu", "StatefulPartitionedCall/model_1/conv3d_52/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_52/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_52/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_52/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_52/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_52/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_53/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_52/Relu", "StatefulPartitionedCall/model_1/conv3d_53/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_25/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_53/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_51/Relu"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1/add_25/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_53/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_25/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_53/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_25/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_54/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_53/Relu", "StatefulPartitionedCall/model_1/conv3d_54/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkRIV0M="}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_54/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_54/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_54/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_54/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_54/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_55/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_54/Relu", "StatefulPartitionedCall/model_1/conv3d_55/Conv3D/merged_input"], "attr": {"data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_26/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_55/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_53/Relu"], "attr": {"N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/add_26/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_55/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_26/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_55/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_26/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_56/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_55/Relu", "StatefulPartitionedCall/model_1/conv3d_56/Conv3D/merged_input"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_56/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_56/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_56/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_56/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_56/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_57/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_56/Relu", "StatefulPartitionedCall/model_1/conv3d_57/Conv3D/merged_input"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/add_27/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_57/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_55/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_1/add_27/ArithmeticOptimizer/AddOpsRewrite_add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/batch_normalization_57/FusedBatchNormV3/Offset", "StatefulPartitionedCall/model_1/add_27/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/model_1/activation_57/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/add_27/ArithmeticOptimizer/AddOpsRewrite_add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_58/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_57/Relu", "StatefulPartitionedCall/model_1/conv3d_58/Conv3D/merged_input"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_58/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/model_1/batch_normalization_58/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/batch_normalization_58/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/activation_58/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_1/batch_normalization_58/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/batch_normalization_59/FusedBatchNormV3/Mul", "op": "Conv3D", "input": ["StatefulPartitionedCall/model_1/activation_58/Relu", "StatefulPartitionedCall/model_1/conv3d_59/Conv3D/merged_input"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_1/add_28/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add", "op": "AddN", "input": ["StatefulPartitionedCall/model_1/batch_normalization_59/FusedBatchNormV3/Mul", "StatefulPartitionedCall/model_1/activation_57/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, 